# შემოიტანე შემთხვევითი რიცხვების წარმოების მოდული
import random


# მოდულის მუდმივები: ესენი არ შეცვალო, არ გაადადგილო, არაფერი არ უქნა
# ესენი გამოიყენე, ქვემოთ დასაწერ, chaitsere_sayidlebi-ის ფუნქციის ბლოკში
PRODUQTEBI = [
    'პომიდორი',
    'კარაქი',
    'კვერცხი',
    'კაკაო',
    'რძე',
    'პური',
    'ყველი',
    'იოგურტი',
    'წიწიბურა',
    'შაქარი',
    'მაკარონი',
    'ზეთი',
    'ფქვილი',
    'სოდა'
]


def chaitsere_sayidlebi(raodenoba=10):
    """
    ფუნქცია, რომელიც ქმნის საყიდლების სიას. გაჩუმებით მიწოდებულ
    რაოენობას იღებს და ამ მოდულის მუდმივა PRODUQTEBI-ს შემთხვევითი
    ინდექსებით მონაცემბს წვდემა და უმატებს სიას:

    0. შექმენი ცარიელი სია

    1. ციკლი აწარმოე არგუმენტ raodenoba ჯერ:
        ა. random.randrange-ის მეშვეობით, PRODUQTEBI სიიდან მიაკითხე
        რამე შემთხვევით, random, ინდექსს (დაფიქრი, დიაპაზონის ქვედა
        და ზედა ზღვარი რა უნდა იყოს, თუ გვინდა რომ PRODUQTEBI სიიდან
        ავიღოთ შემთხვევითი ინდექსი?); შედეგი შეინახე ცვლადში

        ბ. მე-0 ნაბიჯზე შექმნილ სიას მიუმატე ამ წინა ნაბიჯში წარმოებული
        ცვლადი

    2. მე-0 ნაბიჯზე წარმოებული სია დაბეჭდე კონსოლში

    3. მე-0 ნაბიჯზე წარმოებული სია დააბრუნე ფუნქციიდან


    შედეგად აბრუნებს შემთხვევით წარმოებულ საყიდლებს.

    :param raodenoba: int მთელრიცხვა მონაცემთა ტიპი
    :return: list სიას, რომელშიც არის მოთავსებული საყიდლების სახლები,
    მაგალითად:
    ['მაწონი', 'ხაჭო', 'ხაჭო', 'პომიდორი', 'მაწონი']
    """
    need_to_buy = []
    for i in range(raodenoba):
        need_to_buy.append(PRODUQTEBI[random.randrange(0,14)])
    return need_to_buy
#test
#chaitsere_sayidlebi()

def sheavse_macivari(sayidlebis_sia):
    """
    დაწერეთ ფუნქცია, რომელიც საყიდლების სიას წაიკითხავს, და დაგვირბუნებს
    ლექსიკონს, რომელშიც იქნება თითო ნივთის სახელი და მისი მაცივარში
    მოთავსებული რაოდენობა:

    0. განცახადე ცარიელი ლექსიკონი და შეინახე ცვლადში
    1. არგუმენტ saydilebis_sia-ში თითო ელემენტზე მოახდინეთ იტერაცია:
        ა. შეამოწმეთ, ელემენტი არსებობს თუ არა მე-0 ნაბიჯზე შექმნილ
        ლექსიკონში, გასაღებად:
            - თუ არ არსებობს: ეს ელემენტი შეინახეთ როგორც ლექსიკონის
            გასაღები და მიუთითეთ რიცხვი 1
            - თუ არსებობს: არსებულ გასაღებს **მიუმატეთ** 1
    2. შედეგად მიღებულ ლექსიკონს აბრუნებს

    :param sayidlebis_sia: list სია; საყიდლების სია, თითო ელემენტი სტრიქონია,
    მაგალითად:
    ['მაწონი', 'ხაჭო', 'ხაჭო', 'პომიდორი', 'მაწონი']
    :return: dict ლექსიკონი; წამროადგენს მაცივარს, სადაც თითო წყვილის
    გასაღები არის სტრიქონი და მნიშვენლობა არის მთელრიცხვა მონაცემთა ტიპი,
    მაგალითად:
    {
        'მაწონი': 2,
        'ხაჭო': 2,
        'პომიდორი': 1
    }
    (შეიძლება თანმიმდევრობა იყოს სხვანაირი, რადგან ლექსიკონი დაუხარისხებელი
    მონაცემთა ტიპი არის. მაგას მნიშვნელობა არ აქვს)
    """
    #სატესტო სია
    #macivari = {"ზეთი": 5,'შაქარი': 5,'მაკარონი': 5,}
    macivari = dict()
    for i in sayidlebis_sia:
        if (i in macivari) is False:
            print(f"{i} მაცივარში არ არის, ვდებთ 1 ცალს")
            macivari[i] = 1
        elif (i in macivari) is True:
            print(f"{i} მაცივარში არის რაოდენობით *{macivari[i]}* , ვამატებთ 1 ცალს")
            macivari[i] += 1
    print(f"მაცივარში არის: {macivari}")
    return macivari
#ტესტირება
#sheavse_macivari((chaitsere_sayidlebi(6)))


def gamoakle_nivti(macivari, nivti):
    """
    დაწერე ფუნქცია,რომელიც არგუმენტ macivari-ის ლექსიკონიდან,
    მეორე არგუმენტად მიწოდბულ nivti-ის გასაღებით მნიშვნელობას მიწვდება,
    გასაღებსა და მნიშვნელობას დაბეჭდავს, და ბოლოს, nivti გასაღებით მითითებულ
    მნიშვნელობას ლექსიკონიდან ბოლომდე ამოშლის:

    0. არგუმენტი nivti-ის გასაღები შეამოწმე ლექსიკონში არსებობს თუ არა:
        ა. თუ არსებობს:
            - nivti-ს გასაღები და მის მიერ მითითებული მნიშვნელობა კონსოლში
            დაბეჭდე
            - როგორც გსურს, ისე ამოშალე ეს წყვილი ლექსიკონიდან
        ბ. თუ არ არსებობს:
            - მომხმარებელს კონსოლში დაუბეჭდე რამე შეტყობინება, რაც გააგებინებს
            რომ ეს გასაღები ლექსიკონში არ არასებობს

    :param macivari: dict, ლექსიკონი; წარმოადგენს საყიდლებს, მაგალითად,
    ასე შეიძლება გამოიყურებოდეს:
      {
        'მაწონი': 2,
        'ხაჭო': 2,
        'პომიდორი': 1
    }

    :param nivti: str სტრიქონი; სტრიქონი რომელიც წარმოადგენს გასაღებს, რომელიც
    შეიძლება ლექსიკონში იყოს ან არ იყოს
    """
    if (nivti in macivari) is True:
        print(f"მაცივარში არის *{nivti}* ოდენობით: {macivari[nivti]} ")
        print(f"ვიღებთ მთლიანად ნივთს *{nivti}* მაცივრიდან")
        macivari.pop(nivti)
        #print(macivari)
    elif (nivti in macivari) is False:
        print(f"ნივთი *{nivti}* მაცივარში არ მოიძებნება!")
        #print(macivari)
    return macivari

#ტესტირება
#d = {"1" : 1 , "3" : 3}
#gamoakle_nivti(d,"1") , gamoakle_nivti(d,"2")



def macivris_shemotsmeba(macivari):
    """
    დაწერე ფუნქცია, რომელიც არგუმენტად მიწოდებული ლექსიკონის თითო
    გასაღებსა და მის მიერ მითითებულ მნიშვნელობას, მომხმარებლისთვის გასაგებად
    დაბეჭდავს. ამისთვის რამოდენიმე ხერხია, რაც გვაგვივლია. ამოირჩიე ერთ-ერთი.

    :param macivari: dict ლექსიკონი, რომლის თითო წყვილი არის
        ნივთი: რაოდენობა, ანუ str: int

    {
        'მაწონი': 2,
        'ხაჭო': 2,
        'პომიდორი': 1
    }


    მაგალითად, შეიძლება დაბეჭდოს ასეთი მაცივარი:

        'მაწონი': 2,
        'ხაჭო': 2,
        'პომიდორი': 1
    """
    print(f"მაცივრის შემოწმება: ")
    for i in macivari:
        print(f"{i}: *{macivari[i]}* ერთეული")


def test_code():
    step_1 = chaitsere_sayidlebi(10)
    step_2 = sheavse_macivari(step_1)
    step_3 = gamoakle_nivti(step_2,"წიწიბურა")
    step_4 = step_3
    macivris_shemotsmeba(step_4)
#test_code()