# შემოიტანე მოდული macivari; თუ გინდა მთლიანად, თუ გინდა კონკრეტული
import time
import sys

import macivari
# ნაწილები, და თუ გინდა, ფესვდონიმების მინიჭებით



def main():
    """
    მთავარი ფუნქცია. ფუნქციის ტანში, კომენტრაის სახით გაწერილ ინსტრუქციებს
    მიყევით.

    :return:
    """
    # 0. მომხმარებელს ჰკითხე, რამდენი ნივთის ამოტანა სსურს:
    # ა. პასუხი ცვლადში შეინახე; დაიფქრდი, ეს აუცილებლად რამე
    # "რიცხვის" ტიპი უნდა იყოს
    count = int(input("რამდენი ნივთის ამოტანა გსურს, მომხმარებელო?: "))
    time.sleep(1)

    # 1. macivari მოდულიდან გამოიძახე ფუნქცია, chaitsere_sayidlebi:
    # ა. გაჩუმებით არგუმენტად, მიახოდე მ-0 ნაბიჯში წარმოებული ცვლადი
    # ბ. შედეგად მიღებუკუ სია შეინახე ცვლადში
    sia_main = macivari.chaitsere_sayidlebi(count)
    print(f"რა უნდა იყიდო: {sia_main}")
    time.sleep(2)
    print("შენ ყველაფერი იყიდე და მიხვედი სახლში მაცივართან, გააღე კარი და უყურებ:")
    time.sleep(1)


    # 2. macivari მოდულიდან გამოიძახე ფუნქცია, sheavse_macivari:
    # ა. არგუმენტად მიაწოდე მე-1 ნაბიჯის შედეგად მიღებული ცვლადი
    # ბ. შედეგად მიღებული ლექსიკონი შეინახე ცვლადში
    macivari_main = macivari.sheavse_macivari(sia_main)
    time.sleep(2)



    # 3. macivari მოდულიდან გამოიძახე ფუნქცია, macivris_shemotsmeba:
    # ა. არგუმენტად მიაწოდე მე-2 ნაბიჯის შედეგად მიღებული ლექსიკონი
    macivari.macivris_shemotsmeba(macivari_main)
    time.sleep(2)


    # 4. ციკლის მეშვეობით, მომხმარებელს 3-ჯერ ჰკითხე:
    # ა. რა აქვს ნაყიდი? პასუხი შეინახე ცვლადში
    # ბ. macivari მოდულიდან გამოიძახე ფუნქცია, gamoakle_nivti:
    #     - არგუმენტად მიაწოდე მე-2 ნაბიჯის შედეგად მიღებული
    #     ლიექსკონი და 4.ა ნაბიჯში შენახული ნივთი
    for i in range(3):
        answer = str(input("რა გაქვს ნაყიდი, მომხმარებელო?: "))
        macivari.gamoakle_nivti(macivari_main,answer)


    # 5. macivari მოდულიდან გამოიძახე ფუნქცია, dabechde_sayidlebi:
    # ა. არგუმენტად მიაწოდე მე-2 ნაბიჯის შედეგად მიღებული ლექსიკონი
    sys.exit("ბატონ ნიკას არ აქვს გაწერილი dabechde_sayidlebi ფუნქცია")


main()
