[
    {
        "date": "2010-11-07",
        "explanation": "A fantastic jumble of young blue star clusters, gigantic glowing gas clouds, and imposing dark dust lanes surrounds the central region of the active galaxy Centaurus A. This mosaic of Hubble Space Telescope images taken in blue, green, and red light has been processed to present a natural color picture of this cosmic maelstrom. Infrared images from the Hubble have also shown that hidden at the center of this activity are what seem to be disks of matter spiraling into a black hole with a billion times the mass of the Sun! Centaurus A itself is apparently the result of a collision of two galaxies and the left over debris is steadily being consumed by the black hole. Astronomers believe that such black hole central engines generate the radio, X-ray, and gamma-ray energy radiated by Centaurus A and other active galaxies. But for an active galaxy Centaurus A is close, a mere 10 million light-years away, and is a relatively convenient laboratory for exploring these powerful sources of energy.",
        "hdurl": "https://apod.nasa.gov/apod/image/1011/cenA_hst_big.jpg",
        "media_type": "image",
        "service_version": "v1",
        "title": "The Center of Centaurus A",
        "url": "https://apod.nasa.gov/apod/image/1011/cenA_hst.jpg"
    },
    {
        "date": "2005-12-16",
        "explanation": "Scroll right and gaze through the dusty plane of our Milky Way Galaxy in infrared light. The cosmic panorama is courtesy of the Galactic Legacy Infrared Mid-Plane Survey Extraordinaire (GLIMPSE) project and the Spitzer Space Telescope. The galactic plane itself runs through the middle of the false-color view that spans nine degrees (about 18 full moons) across the southern constellation Norma. Spitzer's infrared cameras see through much of the galaxy's obscuring dust revealing many new star clusters as well as star forming regions (bright white splotches) and hot interstellar hydrogen gas (greenish wisps). The pervasive red clouds are emission from dust and organic molecules, pocked with holes and bubbles blown by energetic outflows from massive stars. Intensely dark patches are regions of dust too dense for even Spitzer's infrared vision to penetrate.",
        "hdurl": "https://apod.nasa.gov/apod/image/0512/galPlane_spitzer_f25.jpg",
        "media_type": "image",
        "service_version": "v1",
        "title": "GLIMPSE the Milky Way",
        "url": "https://apod.nasa.gov/apod/image/0512/galPlane_spitzer_f25.jpg"
    }
]